Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет.

Console.Clear();
Console.WriteLine("Введите любое число в диапазоне от 100 до -100 :");
int a1 = int.Parse(Console.ReadLine()!);

